%%%-------------------------------------------------------------------
%%% @author zhengsiying
%%% @doc
%%%        自动生成文件，不要手动修改
%%% @end
%%% Created : 2016/10/12
%%%-------------------------------------------------------------------

%% ===================================================================
%% record
%% ===================================================================

-record(active_service_conf, {
	id, %% 活动id
	type, %% 奖励类型
	rank, %% 排名（排名大于0的就表示只有一份全服）
	value, %% 条件参数
	reward_zhanshi, %% 战士奖励列表
	reward_fashi, %% 法师奖励列表
	reward_daoshi, %% 道士奖励列表(全服击杀奖励)
	reward, %% 单人击杀奖励
	num, %% 数量
	condition_text, %% 条件内容描述
	min_jade, %% 最小元宝
	max_jade, %% 最大元宝
	info, %% 公告内容
	mail_title, %% 邮件标题
	mail_text %% 邮件内容
}).