%%%-------------------------------------------------------------------
%%% @author zhengsiying
%%% @doc
%%%        自动生成文件，不要手动修改
%%% @end
%%% Created : 2016/10/12
%%%-------------------------------------------------------------------

%% ===================================================================
%% record
%% ===================================================================

-record(active_reward_conf, {
	key, %% 奖励id
	min_lv, %% 最小等级
	max_lv, %% 最大等级
	type, %% 奖励类型
	value, %% 条件参数
	reward, %% 奖励列表
	reward_zhanshi, %% 战士奖励列表
	reward_fashi, %% 法师奖励列表
	reward_daoshi, %% 道士奖励列表
	counter_id %% 计数器id
}).