%%%-------------------------------------------------------------------
%%% @author zhengsiying
%%% @doc
%%%        自动生成文件，不要手动修改
%%% @end
%%% Created : 2016/10/12
%%%-------------------------------------------------------------------

%% ===================================================================
%% record
%% ===================================================================

-record(city_officer_conf, {
	id, %% 官员id
	num, %% 数量
	name, %% 官员名称
	isshow, %% 是否在表里面添加
	day_reward_goods, %% 官员每日奖励
	frist_reward_goods, %% 城主首次奖励
	every_reward_goods %% 每次城主奖励
}).