%%%-------------------------------------------------------------------
%%% @author zhengsiying
%%% @doc
%%%        自动生成文件，不要手动修改
%%% @end
%%% Created : 2016/10/12
%%%-------------------------------------------------------------------

%% ===================================================================
%% record
%% ===================================================================

-record(instance_conf, {
	scene_id, %% 场景id
	next_id, %% 下级副本
	type, %% 副本类型
	setup_time, %% 准备时间
	end_time, %% 结束时间
	close_time, %% 关闭时间
	times_limit, %% 进入次数限制
	buy_limit, %% 额外购买次数
	cost, %% 花费
	pass_condition, %% 通关条件
	pass_prize, %% 通关奖励
	boss_id, %% BOSSID
	recover, %% 进出满状态
	mail_reward %% 邮件奖励
}).