%%%-------------------------------------------------------------------
%%% @author zhengsiying
%%% @doc
%%%        自动生成文件，不要手动修改
%%% @end
%%% Created : 2016/10/12
%%%-------------------------------------------------------------------

%% ===================================================================
%% record
%% ===================================================================

-record(mail_conf, {
	id, %% 礼包id
	mail_type, %% 邮件类型(0系统1其他2全服)
	sender, %% 发送者
	title, %% 邮件标题
	content, %% 邮件内容
	award, %% 邮件奖励
	active_time, %% 邮件有效时间
	update_time %% 更新时间
}).