%%%-------------------------------------------------------------------
%%% @author zhengsiying
%%% @doc
%%%        自动生成文件，不要手动修改
%%% @end
%%% Created : 2016/10/12
%%%-------------------------------------------------------------------

%% ===================================================================
%% record
%% ===================================================================

-record(shop_conf, {
	key, %% 商品id
	type, %% 商品类型
	goods_id, %% 道具id
	is_bind, %% 是否绑定
	num, %% 数量
	curr_type, %% 货币类型
	price, %% 价格
	limit_vip, %% vip购买限制
	counter_id %% 购买计数器
}).