%%%-------------------------------------------------------------------
%%% @author zhengsiying
%%% @doc
%%%        自动生成文件，不要手动修改
%%% @end
%%% Created : 2016/10/12
%%%-------------------------------------------------------------------

%% ===================================================================
%% record
%% ===================================================================

-record(skill_conf, {
	skill_id, %% 技能id
	lv, %% 技能等级
	type, %% 技能类型
	cost_mp, %% 消耗魔法
	cd, %% 技能cd
	spell_distance, %% 施法距离
	hit, %% 是否控制必中
	target, %% 作用目标
	range, %% 范围
	effect_list, %% 技能效果
	spell_time %% 施法时间
}).