%%%-------------------------------------------------------------------
%%% @author zhengsiying
%%% @doc
%%%        自动生成文件，不要手动修改
%%% @end
%%% Created : 2016/10/12
%%%-------------------------------------------------------------------

%% ===================================================================
%% record
%% ===================================================================

-record(vip_conf, {
	id, %% 编号
	career, %% 职业
	lv, %% vip等级
	exp, %% vip等级经验
	goods, %% vip奖励
	hook_num, %% 挂机增加次数
	hook_exp, %% 挂机经验增加
	fh_num, %% 复活次数
	rank_num, %% 排位赛次数
	clear_red, %% 清除红名
	store_num, %% 仓库格子
	buy_hook_num, %% 允许购买挂机次数
	boss_transfer, %% boss传送次数
	buy_fb_num, %% 允许购买个人副本次数
	sign_num, %% 每日签到补签次数
	drop_modulus, %% 掉落系数
	exam_tools, %% 答题道具个数
	vipbuffid, %% vipbuffid
	 attr_base %% 基础属性
}).